article/selenium-for-auto-testing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-23 Sun 13:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Title</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Title</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd2165b6">1. 前言</a></li>
<li><a href="#org9c69361">2. 安装与配置</a>
<ul>
<li><a href="#orgba7decf">2.1. Chrome Driver</a></li>
<li><a href="#orgb12b6a2">2.2. Firefox Driver</a></li>
<li><a href="#orgcc62b45">2.3. Selenium</a></li>
</ul>
</li>
<li><a href="#org98369c3">3. 使用</a>
<ul>
<li><a href="#org3a2195c">3.1. Chrome 有界面运行</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgd2165b6" class="outline-2">
<h2 id="orgd2165b6"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://www.selenium.dev/">Selenium</a> 是一个用于 Web 应用程序测试的工具。 Selenium 测试直接运行在浏览器中，
就像真正的用户在操作一样。支持的浏览器包括 IE（7, 8, 9, 10, 11），Firefox，
Safari，Chrome，Opera 等。 使用 python 爬虫调用 selenium 来模拟正常用户访问浏
览器
</p>
</div>
</div>

<div id="outline-container-org9c69361" class="outline-2">
<h2 id="org9c69361"><span class="section-number-2">2</span> 安装与配置</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgba7decf" class="outline-3">
<h3 id="orgba7decf"><span class="section-number-3">2.1</span> Chrome Driver</h3>
<div class="outline-text-3" id="text-2-1">
<p>
安装 Chrome Driver, 该工具供 Selenium 使用 Chrome. 下载前先查看本地环境的
Chrome 版本, 然后去上面的 <a href="http://npm.taobao.org/mirrors/chromedriver/">taobao mirror</a> 中下载对应的 ChromeDriver 版本.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ChromeDriver</th>
<th scope="col" class="org-left">Chrome</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">v2.37</td>
<td class="org-left">v64-66</td>
</tr>

<tr>
<td class="org-left">v2.36</td>
<td class="org-left">v63-65</td>
</tr>

<tr>
<td class="org-left">v2.35</td>
<td class="org-left">v62-64</td>
</tr>

<tr>
<td class="org-left">v2.34</td>
<td class="org-left">v61-63</td>
</tr>

<tr>
<td class="org-left">v2.33</td>
<td class="org-left">v60-62</td>
</tr>

<tr>
<td class="org-left">v2.32</td>
<td class="org-left">v59-61</td>
</tr>

<tr>
<td class="org-left">v2.31</td>
<td class="org-left">v58-60</td>
</tr>

<tr>
<td class="org-left">v2.30</td>
<td class="org-left">v58-60</td>
</tr>

<tr>
<td class="org-left">v2.29</td>
<td class="org-left">v56-58</td>
</tr>

<tr>
<td class="org-left">v2.28</td>
<td class="org-left">v55-57</td>
</tr>

<tr>
<td class="org-left">v2.27</td>
<td class="org-left">v54-56</td>
</tr>

<tr>
<td class="org-left">v2.26</td>
<td class="org-left">v53-55</td>
</tr>

<tr>
<td class="org-left">v2.25</td>
<td class="org-left">v53-55</td>
</tr>

<tr>
<td class="org-left">v2.24</td>
<td class="org-left">v52-54</td>
</tr>

<tr>
<td class="org-left">v2.23</td>
<td class="org-left">v51-53</td>
</tr>
</tbody>
</table>

<p>
将下载的 ChromeDriver 进行解压,将解压后的文件移动到 <code>/usr/loacl/bin</code> 目录中.
</p>

<div class="org-src-container">
<pre class="src src-text">$ chromedriver -v
ChromeDriver 81.0.4044.20 (f006328e39a9769596eb506c8841c3004b24e747-refs/branch-heads/4044@{#244})
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb12b6a2" class="outline-3">
<h3 id="orgb12b6a2"><span class="section-number-3">2.2</span> Firefox Driver</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://github.com/mozilla/geckodriver/releases">Firefox Driver</a> 下载方式类似
</p>

<div class="org-src-container">
<pre class="src src-text">$ ./geckodriver --version
geckodriver 0.26.0 (e9783a644016 2019-10-10 13:38 +0000)

The source code of this program is available from
testing/geckodriver in https://hg.mozilla.org/mozilla-central.

This program is subject to the terms of the Mozilla Public License 2.0.
You can obtain a copy of the license at https://mozilla.org/MPL/2.0/.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc62b45" class="outline-3">
<h3 id="orgcc62b45"><span class="section-number-3">2.3</span> Selenium</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sh">pip3 install selenium
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org98369c3" class="outline-2">
<h2 id="org98369c3"><span class="section-number-2">3</span> 使用</h2>
<div class="outline-text-2" id="text-3">
<p>
文档详细见 <a href="https://www.selenium.dev/documentation/en/">doc</a>
</p>
</div>
<div id="outline-container-org3a2195c" class="outline-3">
<h3 id="org3a2195c"><span class="section-number-3">3.1</span> Chrome 有界面运行</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #93a1a1; font-style: italic;">#</span><span style="color: #93a1a1; font-style: italic;">!/usr/bin/env python3</span>
<span style="color: #859900;">from</span> selenium <span style="color: #859900;">import</span> webdriver
<span style="color: #859900;">from</span> selenium.webdriver.common.by <span style="color: #859900;">import</span> By
<span style="color: #859900;">from</span> selenium.webdriver.common.keys <span style="color: #859900;">import</span> Keys
<span style="color: #859900;">from</span> selenium.webdriver.support.ui <span style="color: #859900;">import</span> WebDriverWait
<span style="color: #859900;">from</span> selenium.webdriver.support.expected_conditions <span style="color: #859900;">import</span> presence_of_element_located

<span style="color: #93a1a1; font-style: italic;">#</span><span style="color: #93a1a1; font-style: italic;">This example requires Selenium WebDriver 3.13 or newer</span>
<span style="color: #859900;">with</span> webdriver.Chrome<span style="color: #8d5649;">()</span> <span style="color: #859900;">as</span> driver:
  <span style="color: #6c71c4;">wait</span> = WebDriverWait<span style="color: #8d5649;">(</span>driver, 10<span style="color: #8d5649;">)</span>
  driver.get<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"http://www.baidu.com"</span><span style="color: #8d5649;">)</span>
  driver.<span style="color: #268bd2;">quit</span><span style="color: #8d5649;">()</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2020-02-23 Sun 13:36. Created by Jinghui Hu at 2020-02-23 Sun 13:13.</p>
</div>
</body>
</html>
